; domain
; @Authors: LAPEYRADE Sylvain; sylla801
;           BOURAKKADI Reda; redbo196
; @File: Domain shakey_world definition 
; @Task: 1. Implementation of the alternative 2: Shakey's World

(define (domain shakey_world)

(:requirements :strips) ; Only strips required

(:predicates ;Properties of objects 
    ;; statics -- properties always true
    (is_connected ?room_a ?room_b ?door) ; Shakey can go from room_a to room_b through a door
    (is_wide ?door) ; Door are either wide or narrow (box can be pushed only through wide)
    (is_box ?object) ; Only boxes can be pushed and climbed upon
    (is_small ?object) ; Only small objects can be carried
    (is_switch ?object) ; Only lights switches can be switched
    (is_shakey ?object) ; Only Shakey can move, climb, switch light, pick and push objects

    ;; dynamics -- properties that can be changed
    (is_gripper_free ?gripper) ; If at least one gripper is free
    (is_object_gripped ?object ?gripper) ; If an object is hold in a grip
    (is_in ?object ?room) ; If the object is in the room
    (is_on_box ?shakey) ; If Shakey is on a box
    (is_light_on ?light) ; If the light is on
)


;; Shakey move from room_a to room_b 
;; if they are adjacent and connected through a door
;; and if Shakey is not on a box
(:action move_room
:parameters (?shakey ?room_a ?room_b ?door)
:precondition (and(is_shakey ?shakey)
                (is_in ?shakey ?room_a)
                (is_connected ?room_a ?room_b ?door)
                (not(is_on_box ?shakey)))
:effect (and(not (is_in ?shakey ?room_a))
                (is_in ?shakey ?room_b))
)

;; Shakey climb to a box if they are in the same room
(:action climb_box
:parameters (?shakey ?box ?room)
:precondition (and(is_shakey ?shakey)
                (is_in ?shakey ?room)
                (is_in ?box ?room)
                (is_box ?box)
                (not(is_on_box ?shakey)))
:effect(is_on_box ?shakey)
)

;; Shakey descend from a box if they are in the same room
;; and if he is already on a box
(:action descend_box
:parameters (?shakey ?box ?room)
:precondition (and(is_shakey ?shakey)
                (is_in ?shakey ?room)
                (is_in ?box ?room)
                (is_on_box ?shakey))
:effect(not(is_on_box ?shakey))
)

;; Shakey can turn the light on if he is in the same room as the light switch
;; and if he is on a box
(:action turn_on_light
:parameters (?shakey ?light ?room)
:precondition (and(is_shakey ?shakey)
                (is_on_box ?shakey)
                (is_in ?shakey ?room)
                (is_in ?light ?room)
                (is_switch ?light)
                (not(is_light_on ?light)))
:effect (is_light_on ?light)
)

;; Shakey can turn the light off if he is in the same room as the light switch on
;; and if he is on a box
(:action turn_off_light
:parameters (?shakey ?light ?room)
:precondition (and(is_shakey ?shakey)
                (is_on_box ?shakey)
                (is_in ?shakey ?room)
                (is_in ?light ?room)
                (is_switch ?light)
                (is_light_on ?light))
:effect (not(is_light_on ?light))
)

;; Shakey can push an object to another room if it is a box,
;; if they are in the same room, and if the door is wide.
(:action push_box
:parameters (?shakey ?box ?room_a ?room_b ?door)
:precondition (and(is_shakey ?shakey)
                (is_box ?box)
                (is_connected ?room_a ?room_b ?door)
                (is_wide ?door)
                (is_in ?shakey ?room_a)
                (is_in ?box ?room_a)
                (not(is_on_box ?box)))
:effect (and(not(is_in ?shakey ?room_a))
            (is_in ?shakey ?room_b)
            (not(is_in ?box ?room_a))
            (is_in ?box ?room_b))
)


;; Shakey can pick an object in the room if the object is small and
;; if the gripper selected is free
;; Also light must be turned on in the room
(:action pick_object
:parameters(?shakey ?object ?gripper ?room ?light)
:precondition(and(is_shakey ?shakey)
                (is_in ?shakey ?room)
                (is_in ?object ?room)
                (is_in ?light ?room)
                (is_light_on ?light)
                (is_small ?object)
                (is_gripper_free ?gripper);
                (not(is_on_box ?shakey)))
:effect(and(not(is_in ?object ?room))
            (is_object_gripped ?object ?gripper);
            (not(is_gripper_free ?gripper)));
)

;; Shakey can drop an object in the current room if he is holding one
(:action drop_object
:parameters(?shakey ?object ?gripper ?room)
:precondition(and(is_shakey ?shakey)
                (is_in ?shakey ?room)
                (is_object_gripped ?object ?gripper)
                (not(is_on_box ?shakey)))
:effect(and(is_in ?object ?room)
            (not(is_object_gripped ?object ?gripper))
            (is_gripper_free ?gripper))
)

)

; problem
; @Authors: LAPEYRADE Sylvain; sylla801
;           BOURAKKADI Reda; redbo196
; @File: Problem 1
; @Task: 1. Implementation of the alternative 2: Shakey's World
;   Problem 1:
;   Shakey must move the two toys to room 3 and get back to room 1
;   with the lights of room 1, 2 and 3 turned off
; @ Usage:
; FF: /courses/TDDC17/bin/ff -o task1/shakey_domain.pddl -f task1/shakey_problem1.pddl
; Lama: /courses/TDDC17/bin/downward/src/lama task1/shakey_domain.pddl task1/shakey_problem1.pddl
 
(define (problem problem1) (:domain shakey_world)
(:objects
    shakey gripper1 gripper2
    room1 room2 room3
    door1 door2 door3
    lightswitch1 lightswitch2 lightswitch3
    box toy1 toy2
)

(:init ; Initial state
    (is_connected room1 room2 door1) (is_connected room2 room1 door1)
    (is_connected room1 room2 door2) (is_connected room2 room1 door2)
    (is_connected room2 room3 door3) (is_connected room3 room2 door3)
    (is_wide door2) (is_wide door3)
    (is_in lightswitch1 room1) (is_switch lightswitch1)
    (is_in lightswitch2 room2) (is_switch lightswitch2)
    (is_in lightswitch3 room3) (is_switch lightswitch3)
    (is_in shakey room1) (is_shakey shakey)
    (is_gripper_free gripper1) (is_gripper_free gripper2)
    (is_box box) (is_in box room1)
    (is_small toy1) (is_small toy2) (is_in toy1 room1) (is_in toy2 room2)
)

(:goal ; Final State
    (and(is_in toy1 room3)
        (is_in toy2 room3)
        (not(is_light_on lightswitch1))
        (not(is_light_on lightswitch2))
        (not(is_light_on lightswitch3))
        (is_in shakey room1))
)
)

; plan
1. (climb_box shakey box room1)
   added: (is_on_box shakey)
   goals met: 4 of 6
2. (turn_on_light shakey lightswitch1 room1)
   added: (is_light_on lightswitch1)
   goals met: 3 of 6
3. (descend_box shakey box room1)
   deleted: (is_on_box shakey)
   goals met: 3 of 6
4. (pick_object shakey toy1 gripper1 room1 lightswitch1)
   deleted: (is_in toy1 room1) (is_gripper_free gripper1)
   added: (is_object_gripped toy1 gripper1)
   goals met: 3 of 6
5. (climb_box shakey box room1)
   added: (is_on_box shakey)
   goals met: 3 of 6
6. (turn_off_light shakey lightswitch1 room1)
   deleted: (is_light_on lightswitch1)
   goals met: 4 of 6
7. (descend_box shakey box room1)
   deleted: (is_on_box shakey)
   goals met: 4 of 6
8. (push_box shakey box room1 room2 door2)
   deleted: (is_in shakey room1) (is_in box room1)
   added: (is_in shakey room2) (is_in box room2)
   goals met: 3 of 6
9. (push_box shakey box room2 room3 door3)
   deleted: (is_in shakey room2) (is_in box room2)
   added: (is_in shakey room3) (is_in box room3)
   goals met: 3 of 6
10. (drop_object shakey toy1 gripper1 room3)
   deleted: (is_object_gripped toy1 gripper1)
   added: (is_in toy1 room3) (is_gripper_free gripper1)
   goals met: 4 of 6
11. (climb_box shakey box room3)
   added: (is_on_box shakey)
   goals met: 4 of 6
12. (push_box shakey box room3 room2 door3)
   deleted: (is_in shakey room3) (is_in box room3)
   added: (is_in shakey room2) (is_in box room2)
   goals met: 4 of 6
13. (turn_on_light shakey lightswitch2 room2)
   added: (is_light_on lightswitch2)
   goals met: 3 of 6
14. (descend_box shakey box room2)
   deleted: (is_on_box shakey)
   goals met: 3 of 6
15. (pick_object shakey toy2 gripper1 room2 lightswitch2)
   deleted: (is_in toy2 room2) (is_gripper_free gripper1)
   added: (is_object_gripped toy2 gripper1)
   goals met: 3 of 6
16. (climb_box shakey box room2)
   added: (is_on_box shakey)
   goals met: 3 of 6
17. (turn_off_light shakey lightswitch2 room2)
   deleted: (is_light_on lightswitch2)
   goals met: 4 of 6
18. (descend_box shakey box room2)
   deleted: (is_on_box shakey)
   goals met: 4 of 6
19. (push_box shakey box room2 room3 door3)
   deleted: (is_in shakey room2) (is_in box room2)
   added: (is_in shakey room3) (is_in box room3)
   goals met: 4 of 6
20. (drop_object shakey toy2 gripper1 room3)
   deleted: (is_object_gripped toy2 gripper1)
   added: (is_in toy2 room3) (is_gripper_free gripper1)
   goals met: 5 of 6
21. (push_box shakey box room3 room2 door3)
   deleted: (is_in shakey room3) (is_in box room3)
   added: (is_in shakey room2) (is_in box room2)
   goals met: 5 of 6
22. (push_box shakey box room2 room1 door2)
   deleted: (is_in shakey room2) (is_in box room2)
   added: (is_in shakey room1) (is_in box room1)
   goals met: 6 of 6
